tap "anomalyco/tap", trusted: true
tap "charmbracelet/tap", trusted: true
tap "encoredev/tap", trusted: true
tap "homebrew/core"
tap "jonahsnider/frc", "https://github.com/jonahsnider/homebrew-frc.git", trusted: true
tap "jonahsnider/tap", "https://github.com/jonahsnider/homebrew-tap.git", trusted: true
tap "nrlquaker/createzap", trusted: true
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Browser automation CLI for AI agents
brew "agent-browser"
# Fast Node.js package manager
brew "aube"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# CLI tool for analyzing Claude Code usage from local JSONL files
brew "ccusage"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cross-platform make
brew "cmake"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Easily install prebuilt binaries from GitHub
brew "eget"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# LSP implementation for the fish shell language
brew "fish-lsp"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Manage stacked Git branches
brew "git-spice"
# Render markdown on the CLI
brew "glow"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tool for glamorous shell scripts
brew "gum"
# Handy way to save and run project-specific commands
brew "just"
# Compiler for generating binary data parsers
brew "kaitai-struct-compiler"
# Flexible Kustomize Plugin for SOPS Encrypted Resources
brew "ksops"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Selfhosted alternative to 12ft.io and 1ft.io HTTP web proxies
brew "ladder"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal Markdown previewer with a GUI-like experience
brew "leaf-md"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"
# Visual testing tool for MCP servers
brew "mcp-inspector"
# Publisher CLI tool for the Official Model Context Protocol (MCP) Registry
brew "mcp-publisher"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# Command-line Git information tool
brew "onefetch"
# CLI for managing daemons with a focus on developer experience
brew "pitchfork"
# CLI for the Pkl programming language
brew "pkl"
# Replace port numbers with stable, named local URLs for humans and agents
brew "portless"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Develop and deploy code with zero configuration
brew "railway"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for Sanity
brew "sanity"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Autoformat shell script source code
brew "shfmt"
# Editor of encrypted files
brew "sops"
# Toolkit to help you get started with Spec-Driven Development
brew "specify"
# Cross-shell prompt for astronauts
brew "starship"
# Command-line interface for running and interacting with Temporal Server and UI
brew "temporal"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Command-line interface for Vercel
brew "vercel-cli"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Generate images of code and terminal output.
brew "charmbracelet/tap/freeze"
# The static analysis-powered Go framework for building backend applications
brew "encoredev/tap/encore"
# Convert CTR Electronics hoot (.hoot) files into other logging file formats
brew "jonahsnider/frc/owlet"
# Braintrust command-line interface
brew "jonahsnider/tap/bt", trusted: true
# GitHub Model Context Protocol server for AI tools
brew "jonahsnider/tap/github-mcp-server", trusted: true
# Learn how to use CLI apps
brew "jonahsnider/tap/how"
# Command-line interface for 1Password
cask "1password-cli"
# FRC log analysis tool
cask "advantagescope"
# Screen recorder
cask "bettercapture"
# Apple SuperDrive, Apple Keyboard, and Improved iPhone/iPad Charging
cask "caldigit-usb-hub-support-driver"
# Image, video and clipboard optimiser
cask "clop"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# FRC dashboard for viewing camera streams
cask "jonahsnider/frc/dashshund"
# AI-powered software engineering agent by Factory
cask "droid"
# Simple and modern dashboard for FRC
cask "jonahsnider/frc/elastic"
# Native AI agent interface to build, manage, and ship software by Factory
cask "factory"
# Driver station for the FIRST Robotics Competition
cask "jonahsnider/frc/first-driver-station", trusted: true
cask "font-jetbrains-mono"
# Visualisation and debugging tool for robotics
cask "foxglove"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Apple tool to create multi-platform icons
cask "icon-composer"
# HTTP and GraphQL Client
cask "insomnia"
# Open-source keystroke visualiser
cask "keycastr"
# Flash and find Limelight devices
cask "jonahsnider/frc/limelight-hardware-manager"
# Music app blocker utility
cask "music-decoy"
# AI coding agent desktop client
cask "opencode-desktop"
# Native GUI for Apple Containers
cask "orchard"
# Simple yet powerful path planning tool for FRC robots
cask "jonahsnider/frc/pathplanner"
# CLI to create, run, and deploy Slack apps
cask "slack-cli"
# Minimal GUI for AI code agents
cask "t3-code"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@25"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
# Standard software library provided for FRC teams to write robot code
cask "jonahsnider/frc/wpilib"
