tap "encoredev/tap"
tap "withgraphite/tap"

brew "biome"
brew "chezmoi"
brew "ripgrep"
brew "codex"
brew "emscripten"
brew "fastfetch"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "google-java-format"
brew "graphviz"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "mise"
brew "nmap"
brew "scc"
brew "shfmt"
brew "sops"
brew "starship"
brew "temporal"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "encoredev/tap/encore"
brew "withgraphite/tap/graphite"
cask "1password-cli"
cask "gcloud-cli"
cask "keycastr"
cask "claude-code"
cask "iterm2"
brew "direnv"
brew "git"
